esp32m/core/esp32m/src/io/gpio.cpp
     private:
      Pin *_pin;
      adc::Unit *_unit;
      adc_channel_t _channel;
      adc_cali_handle_t _calihandle = nullptr;
      adc_bitwidth_t _width = ADC_BITWIDTH_DEFAULT;
      adc_atten_t _atten = AdcAttenDefault;
      adc::Flags _flags = adc::Flags::Dirty;
      ADC(Pin *pin, adc::Unit *unit, adc_channel_t channel)
          : _pin(pin), _unit(unit), _channel(channel) {}
      esp_err_t update() {
        if ((_flags & adc::Flags::Dirty) != 0) {
          _flags &= ~adc::Flags::Dirty;

          adc_oneshot_chan_cfg_t ccfg = {
              .atten = _atten,
              .bitwidth = _width,
          };
          ESP_CHECK_RETURN(
              adc_oneshot_config_channel(_unit->handle(), _channel, &ccfg));
        }
        return ESP_OK;
      }
    };

#if SOC_DAC_SUPPORTED
    class DAC : public pin::IDAC {
     public:
      virtual ~DAC() {
        ESP_ERROR_CHECK_WITHOUT_ABORT(dac_oneshot_del_channel(_handle));
      }
      esp_err_t write(float value) override {
        if (value < 0 || value > 1)
          return ESP_ERR_INVALID_ARG;
        ESP_CHECK_RETURN(dac_oneshot_output_voltage(_handle, 255 * value));
        _value = value;
        return ESP_OK;
      }
      float getValue() override {
        return _value;
      }

      static esp_err_t create(Pin *pin, pin::Feature **feature) {
        dac_channel_t channel;
        switch (pin->num()) {
          case DAC_CHANNEL_1_GPIO_NUM:
            channel = DAC_CHAN_0;
            break;
          case DAC_CHANNEL_2_GPIO_NUM:
            channel = DAC_CHAN_1;
            break;
          default:
            return ESP_ERR_INVALID_ARG;
        }
        dac_oneshot_handle_t handle;
        dac_oneshot_config_t cfg = {.chan_id = channel};
        ESP_CHECK_RETURN(dac_oneshot_new_channel(&cfg, &handle));
        *feature = new DAC(pin, channel, handle);
        return ESP_OK;
      }

     private:
      dac_channel_t _channel;
      dac_oneshot_handle_t _handle;
      float _value = 0;
      DAC(Pin *pin, dac_channel_t channel, dac_oneshot_handle_t handle)
          : _channel(channel), _handle(handle) {}
    };
#endif
    class Pcnt : public pin::IPcnt {
     public:
      ~Pcnt() override {
        if (_channel && _unit)
          pcnt_unit_stop(_unit);
        if (_channel) {
          pcnt_del_channel(_channel);
          _channel = nullptr;
        }
        if (_unit) {
          pcnt_unit_disable(_unit);
          pcnt_del_unit(_unit);
          _unit = nullptr;
        }
      }
      esp_err_t read(int &value, bool reset = false) override {
        int c;
        ESP_CHECK_RETURN(pcnt_unit_get_count(_unit, &c));
        value = c;
        if (reset)
          ESP_CHECK_RETURN(pcnt_unit_clear_count(_unit));
        return ESP_OK;
      }
      esp_err_t setEdgeAction(pcnt_channel_edge_action_t pos,
                              pcnt_channel_edge_action_t neg) override {
        ESP_CHECK_RETURN(pcnt_channel_set_edge_action(_channel, pos, neg));
        _pea = pos;
        _nea = neg;
        return ESP_OK;
      };
      esp_err_t getEdgeAction(pcnt_channel_edge_action_t &pos,
                              pcnt_channel_edge_action_t &neg) override {
        pos = _pea;
        neg = _nea;
        return ESP_OK;
      };
      esp_err_t setLevelAction(pcnt_channel_level_action_t high,
                               pcnt_channel_level_action_t low) override {
        ESP_CHECK_RETURN(pcnt_channel_set_level_action(_channel, high, low));
        _hla = high;
        _lla = low;
        return ESP_OK;
      };
      esp_err_t getLevelAction(pcnt_channel_level_action_t &high,
                               pcnt_channel_level_action_t &low) override {
        high = _hla;
        low = _lla;
        return ESP_OK;
      };
      esp_err_t setFilter(uint32_t glitchNs) override {
        pcnt_glitch_filter_config_t filter_config = {
            .max_glitch_ns = glitchNs,
        };
        auto wasEnabled = isEnabled();
        if (wasEnabled)
          ESP_CHECK_RETURN(enable(false));
        ESP_CHECK_RETURN(pcnt_unit_set_glitch_filter(_unit, &filter_config));
        if (wasEnabled)
          ESP_CHECK_RETURN(enable(true));
        _glitchNs = glitchNs;
        return ESP_OK;
      };
      esp_err_t getFilter(uint32_t &glitchNs) override {
        glitchNs = _glitchNs;
        return ESP_OK;
      }

      static esp_err_t create(Pin *pin, pin::Feature **feature) {
        pcnt_unit_config_t unit_config = {};
        unit_config.low_limit = SHRT_MIN;
        unit_config.high_limit = SHRT_MAX;
        unit_config.flags.accum_count = true;

        pcnt_unit_handle_t unit;
        pcnt_channel_handle_t channel;
        ESP_CHECK_RETURN(pcnt_new_unit(&unit_config, &unit));
        pcnt_chan_config_t chan_config = {
            .edge_gpio_num = pin->num(),
            .level_gpio_num = -1,
            .flags = {},
        };
        ESP_CHECK_RETURN(pcnt_new_channel(unit, &chan_config, &channel));
        *feature = new Pcnt(pin, unit, channel);
        return ESP_OK;
      };
      esp_err_t enable(bool on) override {
        if (on != _enabled) {
          if (on) {
            ESP_CHECK_RETURN(pcnt_unit_enable(_unit));
            ESP_CHECK_RETURN(pcnt_unit_clear_count(_unit));
            ESP_CHECK_RETURN(pcnt_unit_start(_unit));
          } else {
            ESP_CHECK_RETURN(pcnt_unit_stop(_unit));
            ESP_CHECK_RETURN(pcnt_unit_disable(_unit));
          }
          _enabled = on;
        }
        if (_sampler)
          _sampler->enable(on);
        return ESP_OK;
      }
      bool isEnabled() const override {
        return _enabled;
      };

     private:
      Pin *_pin;
      pcnt_unit_handle_t _unit;
      pcnt_channel_handle_t _channel;
      bool _enabled = false;
      pcnt_channel_edge_action_t _pea = PCNT_CHANNEL_EDGE_ACTION_HOLD,
                                 _nea = PCNT_CHANNEL_EDGE_ACTION_HOLD;
      pcnt_channel_level_action_t _hla = PCNT_CHANNEL_LEVEL_ACTION_KEEP,
                                  _lla = PCNT_CHANNEL_LEVEL_ACTION_KEEP;
      uint32_t _glitchNs = 0;
      Pcnt(Pin *pin, pcnt_unit_handle_t unit, pcnt_channel_handle_t channel)
          : _pin(pin), _unit(unit), _channel(channel) {}
    };

    struct LedcTimer {
      ledc_timer_config_t c;
      int ref;
    };

    LedcTimer *ledcTimers[LEDC_TIMER_MAX] = {};
    std::mutex ledcTimersMutex;
    uint16_t _ledcChannels = 0;

